[
  {
      "id": 1,
      "name": "Aakriti Development Society",
      "description": "Empowering communities through education and literacy programs.",
      "address": "Aakriti Development Institute, Nadaun Chowk, Hamirpur, Himachal Pradesh, PIN 177001",
      "contact": "9876543210",
      "location": "Hamirpur, Himachal Pradesh",
      "tags": ["Education", "Literacy"],
      "website": "https://www.ngoreporter.com/aakriti-development-society/",
      "payment": "Bank of India, Account No. 841310110010284, IFSC - BKID0008413",
      "About": "Empowering communities through education and literacy programs is a transformative endeavor that uplifts individuals and societies alike. By providing access to quality education and fostering literacy skills, these programs pave the way for personal growth, economic advancement, and social cohesion. Education serves as a powerful tool for breaking the cycle of poverty, enabling individuals to secure better employment opportunities and improve their overall quality of life. Moreover, literacy empowers individuals to actively participate in civic life, exercise their rights, and contribute meaningfully to their communities. Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
  },
  {
      "id": 2,
      "name": "Aastha Welfare Society",
      "description": "Providing care and support to underprivileged children for a better future.",
      "address": "AASTHA SPECIAL SCHOOL, Near GPO, Pucca Tank, Nahan, District Sirmaur, Himachal Pradesh 173001",
      "contact": "9876543211",
      "location": "Nahan, District Sirmaur, Himachal Pradesh",
      "tags": ["Children", "Women", "Development"],
      "website": "https://projectheena.com/nitikapbedre",
      "payment": "Bank of India, Account No. 50100555332880, IFSC - HDFC0000133",
      "About": "Aastha Welfare Society is dedicated to providing care and support to underprivileged children for a better future. Our organization is committed to ensuring that every child receives the necessary support and resources to thrive. Through our holistic approach, we address the diverse needs of children, including education, healthcare, and emotional well-being. We believe that by investing in children today, we can create a brighter and more equitable tomorrow."
  },
  {
      "id": 3,
      "name": "Abhinaya Durpan",
      "description": "Promoting art and culture to preserve and celebrate heritage.",
      "address": "House No. 145/6, Muslim Trust Building, Lower Bazar",
      "contact": "9876543212",
      "location": "Lower Bazar",
      "tags": ["Art", "Culture"],
      "website": "https://socialprimes.com/ngo/c7f49e83-9227-4667-86b5-a311a5110c0e",
      "payment": "ICICI Bank, Account No. 032205001782, IFSC - ICIC0000322",
      "About": "Abhinaya Durpan is passionate about promoting art and culture to preserve and celebrate heritage. Our organization is dedicated to fostering artistic expression and cultural enrichment through various initiatives, including performances, workshops, and exhibitions. We believe that art has the power to transcend boundaries, unite communities, and inspire positive change."
  },
  {
      "id": 4,
      "name": "Abhivibha",
      "description": "Caring for the elderly population with respect and dignity.",
      "address": "Geeta Bhawan, Dhingoo Hill, Sanjauli, Shimla-6",
      "contact": "9876543213",
      "location": "Shimla",
      "tags": ["Aged", "Elderly"],
      "website": "https://www.searchdonation.com/ngo",
      "payment": "Bank Name - State Bank of India, Account No. - 32344893165, IFSC - SBIN0001706",
      "About": "Abhivibha is committed to caring for the elderly population with respect and dignity. Our organization provides a range of services to support the physical, emotional, and social well-being of seniors. We believe that every individual deserves to age with dignity, and by providing compassionate care and support, we can enhance the quality of life for our elderly community members."
  },
  {
      "id": 5,
      "name": "Ablaze Educational And Welfare Society",
      "description": "Empowering individuals through education and literacy initiatives.",
      "address": "APT Information Technology, Near NH-21, Old SBI Indiara Cottage, Dhalpur, Kullu (H.P) - 175101",
      "contact": "9876543214",
      "location": "Kullu, Himachal Pradesh",
      "tags": ["Education", "Literacy"],
      "website": "https://www.searchdonation.com/ngo/ablaze-educational-and-welfare-society.php",
      "payment": "bank name- ICICI bank  account no.- 032205001782 - IFSC -  ICIC0000322",
      "About": "Ablaze Educational And Welfare Society is dedicated to empowering individuals through education and literacy initiatives. Our organization is committed to providing access to quality education and fostering literacy skills to enable personal growth and socio-economic development. We believe that education is the key to unlocking human potential and creating a more equitable society."
  },
  {
    "id": 6,
    "name": "Ab Theatre Group",
    "description": "Promoting artistic expression and cultural enrichment through theater.",
    "address": "Dayal store 150/3 lower Bazar Shimla-171001",
    "contact": "9805262780",
    "location": "Shimla",
    "tags": ["Art", "Culture"],
    "website": "https://www.searchdonation.com/ngo/ab-theatre-group.php",
    "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
    "About": "Ab theatre Group is Promoting artistic expression and cultural enrichment through theater is the primary focus of Ab Theatre Group. We believe in the power of theater to inspire, challenge, and provoke thought. Through our performances, workshops, and community outreach programs, we seek to engage audiences, spark dialogue, and promote social change. Our goal is to create a vibrant cultural landscape where creativity thrives and diverse voices are celebrated."
},
{
    "id": 7,
    "name": "Action Research And Training",
    "description": "Advancing agricultural practices for sustainable rural development.",
    "address": "Near SDH Rajgarh, PO and Teshil RAJGARH, Distt SIRMOUR HP, 173101",
    "contact": "9816017162",
    "location": "Sirmaur, Himachal Pradesh",
    "tags": ["Agriculture"],
    "website": "https://www.arth.in/",
    "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706 ",
    "About": "Action Research and Training Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
},
{
    "id": 8,
    "name": "Adarsh Educational And Social Welfare Society",
    "description": "Supporting the elderly population with educational and social initiatives.",
    "address": "Village Bhutti Colony P.O Shamshi Tehsil Bhunter Distt. Kullu (HP) Pin-175126",
    "contact": "9805710412",
    "location": "Kullu, Himachal Pradesh",
    "tags": ["Aged", "Elderly"],
    "website": "https://www.searchdonation.com/ngo/adarsh-educational-welfare-society.php",
    "payment": "bank name- ICICI bank  account no.- 032205001782 - IFSC -  ICIC0000322",
    "About": "Supporting the elderly population with educational and social initiatives is at the heart of Adarsh Educational And Social Welfare Society's mission. We are dedicated to providing comprehensive support services to seniors, including education, healthcare, and social engagement opportunities. Our goal is to ensure that every senior citizen has the resources and support they need to live a dignified and fulfilling life."
},
{
    "id": 9,
    "name": "Adhyatam Welfare Society",
    "description": "Improving health and family welfare through community engagement.",
    "address": "Adyatam Welfare Society, Mohal, Kullu.175126",
    "contact": "9805557432",
    "location": "Kullu, Himachal Pradesh",
    "tags": ["Health", "Family Welfare"],
    "website": "https://www.searchdonation.com/ngo/adhyatam-welfare-society.php?lst=manage",
    "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706 ",
    "About": "Supporting the elderly population with educational and social initiatives is at the heart of Adarsh Educational And Social Welfare Society's mission. We are dedicated to providing comprehensive support services to seniors, including education, healthcare, and social engagement opportunities. Our goal is to ensure that every senior citizen has the resources and support they need to live a dignified and fulfilling life."
},
{
    "id": 10,
    "name": "Al Huda Educational And Vocational Society",
    "description": "Providing educational and vocational opportunities for empowerment.",
    "address": "Al HUDA EDUCATIONAL And VOCATIONAL SOCIETY, Village Dinak, Post Office- Kanaid, Tehsil- Sundar Nagar-175019",
    "contact": "9816460597",
    "location": "Sundar Nagar, Himachal Pradesh",
    "tags": ["Education", "Literacy"],
    "website": "https://www.searchdonation.com/ngo/al-huda-educational-and-vocational-society.php?lst=manage",
    "payment": "bank name- ICICI bank  account no.- 032205001782 - IFSC -  ICIC0000322",
    "About": "Empowering women and children through education and vocational training is the cornerstone of Al Huda Educational And Vocational Society's mission. We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their families."
},
{
    "id": 11,
    "name": "All India Anti Crime Bureau",
    "description": "Protecting human rights and advocating for justice and equality.",
    "address": "KH. NO 382/1 VILLAGE POST OFFICE BHAKRERI DISTT, HAMIRPUR(HP), PIN CODE -174305",
    "contact": "9876543210",
    "location": "Hamirpur, Himachal Pradesh",
    "tags": ["Human Rights"],
    "website": "https://aiacb.com/about-all-india-anti-crime-bureau/",
    "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
    "About": "Improving health and family welfare through community engagement is the primary focus of All India Social Awareness Society Hp. We are committed to promoting holistic health and well-being for individuals and families in our community. Through our educational programs, healthcare initiatives, and community outreach efforts, we seek to empower individuals to make informed decisions about their health and lead healthy, fulfilling lives."
},
{
    "id": 12,
    "name": "All India Educational And Welfare Trust",
    "description": "Empowering children through education and holistic development.",
    "address": "Infoage Corporation, Gurudwara road, Dharamshala, kangra ,HP, India 176215",
    "contact": "9805682900",
    "location": "Dharamshala, Kangra, Himachal Pradesh",
    "tags": ["Children"],
    "website": "https://www.searchdonation.com/ngo/all-india-educational-and-welfare-trust.php",
    "payment": "bank name- ICICI bank account no.- 032205001782 - IFSC - ICIC0000322",
    "About": "Improving health and family welfare through community engagement is the primary focus of All India Social Awareness Society Hp. We are committed to promoting holistic health and well-being for individuals and families in our community. Through our educational programs, healthcare initiatives, and community outreach efforts, we seek to empower individuals to make informed decisions about their health and lead healthy, fulfilling lives."
    },
    {
    "id": 13,
    "name": "All India Social Awareness Society Hp",
    "description": "Promoting animal husbandry practices for sustainable rural livelihoods.",
    "address": "All India Social Awareness Society, V.P.O. Kangoo, Teh. Nadaun, Distt. Hamirpur (H.P.) 177040",
    "contact": "9816094345",
    "location": "Hamirpur, Himachal Pradesh",
    "tags": ["Animal Husbandry"],
    "website": "https://www.searchdonation.com/ngo/all-india-social-awareness-society-hp.php",
    "payment": "bank name- State bank of India account no.- 32344893165 - IFSC - SBIN0001706 ",
    "About": "Improving health and family welfare through community engagement is the primary focus of All India Social Awareness Society Hp. We are committed to promoting holistic health and well-being for individuals and families in our community. Through our educational programs, healthcare initiatives, and community outreach efforts, we seek to empower individuals to make informed decisions about their health and lead healthy, fulfilling lives."
    },
    {
    "id": 14,
    "name": "Alternatively Very New Ideology Avni",
    "description": "Fostering innovation and sustainable practices in animal husbandry.",
    "address": "C/o B.N.Gupta Niwas, H.No. 27/1, Boil;eauganj, Shimla - 1710005, Himachal Pradesh",
    "contact": "9805012345",
    "location": "Shimla, Himachal Pradesh",
    "tags": ["Animal Husbandry"],
    "website": "https://www.apnashimla.com/alternatively-very-new-ideology-avni/",
    "payment": "bank name- ICICI bank account no.- 032205001782 - IFSC - ICIC0000322",
    "About": "Alternatively Very New Ideology Avni, We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their families."
    },
    {
    "id": 15,
    "name": "Amrit Education Society",
    "description": "Dedicated to providing quality education for all-round development.",
    "address": "VILLAGE DHALIARA , TEHSIL DEHRA DISTT KANGRA HP 177103",
    "contact": "9805723456",
    "location": "Kangra, Himachal Pradesh",
    "tags": ["Education", "Literacy"],
    "website": "https://www.searchdonation.com/amrit-education-society",
    "payment": "bank name- Bank of India account no.- 841310110010284 - IFSC - BKID0008413",
    "About": "Empowering women and children through education and vocational training is the cornerstone of Amrit Education Society. We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
    },
    {
    "id": 16,
    "name": "Anahita Foundation",
    "description": "Championing human rights and social justice for marginalized communities.",
    "address": "ABS Globle Institute of Management & Technology, Chadiyar Complex, Behind SBP, Nerchowk, Distt. Mandi H.P. 175008",
    "contact": "9805147852",
    "location": "Mandi, Himachal Pradesh",
    "tags": ["Human Rights"],
    "website": "https://anahitafoundation.org/",
    "payment": "bank name- State bank of India account no.- 32344893165 - IFSC - SBIN0001706 ",
    "About": "Empowering women and children through education and vocational training is the cornerstone of Anahita Foundation. We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
    },
    {
    "id": 17,
    "name": "Anita Salaria Memorial Trust",
    "description": "Promoting animal husbandry practices for sustainable rural livelihoods.",
    "address": "VPO Awankha, Dinanagar, Teh & Distt Gurdaspur",
    "contact": "9816012345",
    "location": "Gurdaspur, Punjab",
    "tags": ["Animal Husbandry"],
    "website": "https://www.searchdonation.com/ngo/anita-salaria-memorial-trust.php",
    "payment": "bank name- ICICI bank account no.- 032205001782 - IFSC - ICIC0000322",
    "About": "Empowering women and children through education and vocational training is the cornerstone of Anita Salaria Memorial Trust mission. We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledgeand resources they need to succeed."
  },
  {
  "id": 18,
  "name": "Anjuman Islamia Churah",
  "description": "Providing educational opportunities for literacy and empowerment.",
  "address": "VPO Ganed Teh. Churah, Distt. Chamba Himachal Pradesh, Pincode 176316",
  "contact": "9816712345",
  "location": "Chamba, Himachal Pradesh",
  "tags": ["Education", "Literacy"],
  "website": "https://www.searchdonation.com/ngo/anjuman-islamia-churah.php",
  "payment": "bank name- State bank of India account no.- 32344893165 - IFSC - SBIN0001706 ",
  "About": "Empowering women and children through education and vocational training is the cornerstone of Al Huda Educational And Vocational Society's mission. We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
  "id": 19,
  "name": "Ankur Welfare Association",
  "description": "Empowering underprivileged children through education and support.",
  "address": "ADHA SWAMI SATSANG ROAD, GAGRET-177201, TEHSIL-AMB, DISTRICT-UNA(hp)",
  "contact": "9806023451",
  "location": "Una, Himachal Pradesh",
  "tags": ["Children"],
  "website": "https://ankurngo.org/",
  "payment": "bank name- Bank of India account no.- 841310110010284 - IFSC - BKID0008413",
  "About": "Improving health and family welfare through community engagement is the primary focus of Ankur Welfare Association. We are committed to promoting holistic health and well-being for individuals and families in our community. Through our educational programs, healthcare initiatives, and community outreach efforts, we seek to empower individuals to make informed decisions about their health and lead healthy, fulfilling lives. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
  "id": 20,
  "name": "Aqsa Educational And Welfare Society Kullu Himachal Pradesh",
  "description": "Promoting sustainable animal husbandry practices for rural development.",
  "address": "Ritu Raj Complex, Dhalpur Kullu, H.P. 175101",
  "contact": "9816612345",
  "location": "Kullu, Himachal Pradesh",
  "tags": ["Animal Husbandry"],
  "website": "https://www.searchdonation.com/ngo/aqsa-educational-and-welfare-socity-kullu-himachal-pradesh.php",
  "payment": "bank name- ICICI bank account no.- 032205001782 - IFSC - ICIC0000322",
  "About": "Supporting the elderly population with educational and social initiatives is at the heart of Aqsa Educational And Welfare Society Kullu Himachal Pradesh mission. We are dedicated to providing comprehensive support services to seniors, including education, healthcare, and social engagement opportunities. Our goal is to ensure that every senior citizen has the resources and support they need to live a dignified and fulfilling life. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
   {
    "id": 21,
    "name": "Arsh Educational And Social Welfare Trust",
    "description": "Empowering individuals through education and literacy initiatives.",
    "address": "Arsh Educational and Social Welfare Trust, Near Post Office, VPO Thunag, Distt - Mandi, Himachal Pradesh",
    "contact": "94187-42054",
    "location": "Mandi, Himachal Pradesh",
    "tags": ["Education", "Literacy"],
    "website": "https://www.searchdonation.com/ngo/arsh-educational-and-social-walfare-trust.php",
    "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
    "About": "Supporting the elderly population with educational and social initiatives is at the heart of Arsh Educational And Social Welfare Trust mission. We are dedicated to providing comprehensive support services to seniors, including education, healthcare, and social engagement opportunities. Our goal is to ensure that every senior citizen has the resources and support they need to live a dignified and fulfilling life. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 22,
    "name": "Arushi Gramin Santhan",
    "description": "Ensuring access to clean drinking water for rural communities.",
    "address": "Near GVM School, Tikker Road Rajgarh",
    "contact": "98055-37554",
    "location": "Rajgarh, Himachal Pradesh",
    "tags": ["Drinking Water"],
    "website": "https://www.searchdonation.com/ngo/arushi-gramin-santhan.php",
    "payment": "bank name- ICICI bank  account no.- 032205001782 - IFSC -  ICIC0000322",
    "About": "Improving health and family welfare through community engagement is the Empowering women and children through education and vocational training is the cornerstone of Arushi Gramin Santhan mission. We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their families. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 23,
    "name": "Aryavart Educational Welfare And Charitable Society",
    "description": "Dedicated to providing quality education and welfare services.",
    "address": "Shiwalik Bhawan, Opp. Tara Hall School, Upper Kaithu, Shimla Himachal Pradesh 171003",
    "contact": "94598-02896",
    "location": "Shimla, Himachal Pradesh",
    "tags": ["Education", "Literacy"],
    "website": "https://www.searchdonation.com/ngo/arushi-gramin-santhan.php",
    "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
    "About": "Improving health and family welfare through community engagement is the Empowering women and children through education and vocational training is the cornerstone of Al Huda Educational And Vocational Society's mission. We believe that education is the key to unlocking opportunities and creating a brighter future. Through our programs, we aim to provide women and children with the knowledge, skills, and resources they need to build better lives for themselves and their families. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 24,
    "name": "Association For Rural And Technical Education Centre",
    "description": "Fostering the holistic development of children through education.",
    "address": "ARTEC, Regd. Office-Village and Post Office Malan, Admn Office: Village Mahendru, P.O. Katora, Tehsil Dehra Distt. Kangra",
    "contact": "97364-32525",
    "location": "Dehra, Kangra, Himachal Pradesh",
    "tags": ["Children"],
    "website": "https://www.searchdonation.com/ngo/arushi-gramin-santhan.php",
    "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706 ",
    "About": "Improving health and family welfare through community engagement is the primary focus of Adhyatam Welfare Society. We are committed to promoting holistic health and well-being for individuals and families in our community. Through our educational programs, healthcare initiatives, and community outreach efforts, we seek to empower individuals to make informed decisions about their health and lead healthy, fulfilling lives. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 25,
    "name": "Association For Rural Entrepreneurship Development",
    "description": "Promoting sustainable animal husbandry practices for rural livelihoods.",
    "address": "BRANCH OFFICE MAHILAMANDAL BUILDING KANDAGHAT DISTT. SOLAN (HP)",
    "contact": "94183-25980",
    "location": "Solan, Himachal Pradesh",
    "tags": ["Animal Husbandry"],
    "website": "https://give.do/discover/H0T/association-for-rural-entrepreneurship-development/",
    "payment": "bank name- ICICI bank  account no.- 032205001782 - IFSC -  ICIC0000322",
    "About": "Supporting the elderly population with educational and social initiatives is at the heart of Association For Rural Technologies mission. We are dedicated to providing comprehensive support services to seniors, including education, healthcare, and social engagement opportunities. Our goal is to ensure that every senior citizen has the resources and support they need to live a dignified and fulfilling life. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 26,
    "name": "Association For Rural Technologies",
    "description": "Preserving and promoting traditional art and cultural practices.",
    "address": "C/o Jagdish Thapa, Village Kothi Deora, Post Office Ghatti, Via Saproon, Tehsil & Distt Solan, Pin No. 173211",
    "contact": "94598-31034",
    "location": "Solan, Himachal Pradesh",
    "tags": ["Art", "Culture"],
    "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
    "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706 ",
    "About": "Supporting the elderly population with educational and social initiatives is at the heart of Association For Rural Technologies mission. We are dedicated to providing comprehensive support services to seniors, including education, healthcare, and social engagement opportunities. Our goal is to ensure that every senior citizen has the resources and support they need to live a dignified and fulfilling life. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 27,
    "name": "Association For Social And Hills Advancement",
    "description": "Promoting sustainable animal husbandry practices for rural livelihoods.",
    "address": "Village and Post Office Khera, Tehsil Palampur, Dist. Kangra, HP- 176086",
    "contact": "94180-45066",
    "location": "Kangra, Himachal Pradesh",
    "tags": ["Animal Husbandry"],
    "website": "https://give.do/discover/H0U/association-for-social-and-hills-advancement/",
    "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
    "About": "Promoting artistic expression and cultural enrichment through theater is the primary focus of Awareness Of this society. We believe in the power of theater to inspire, challenge, and provoke thought. Through our performances, workshops, and community outreach programs, we seek to engage audiences, spark dialogue, and promote social change. Our goal is to create a vibrant cultural landscape where creativity thrives and diverse voices are celebrated. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 28,
    "name": "Association For Social Health In India",
    "description": "Protecting and promoting the welfare of children and families.",
    "address": "Association for Social Health in India, Block No.3, Set No.35, US Club Shimla(H.P)171001",
    "contact": "94180-11625",
    "location": "Shimla, Himachal Pradesh",
    "tags": ["Children"],
    "website": "https://www.ashiindia.org/",
    "payment": "bank name- ICICI bank  account no.- 032205001782 - IFSC -  ICIC0000322",
    "About": "Promoting artistic expression and cultural enrichment through theater is the primary focus of Awareness Of this society. We believe in the power of theater to inspire, challenge, and provoke thought. Through our performances, workshops, and community outreach programs, we seek to engage audiences, spark dialogue, and promote social change. Our goal is to create a vibrant cultural landscape where creativity thrives and diverse voices are celebrated. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
  },
  {
    "id": 29,
    "name": "Association For Social Research And Action",
    "description": "Promoting art and cultural activities for community enrichment.",
    "address": "HNo 22/5, Palace Colony Colony, Mandi H.P. 175001",
    "contact": "94180-28532",
    "location": "Mandi, Himachal Pradesh",
    "tags": ["Art", "Culture"],
    "website": "https://www.asrapatna.in/",
"payment": "bank name- State bank of India account no.- 32344893165 - IFSC - SBIN0001706 ",
"About": "Promoting artistic expression and cultural enrichment through theater is the primary focus of Awareness Of this society. We believe in the power of theater to inspire, challenge, and provoke thought. Through our performances, workshops, and community outreach programs, we seek to engage audiences, spark dialogue, and promote social change. Our goal is to create a vibrant cultural landscape where creativity thrives and diverse voices are celebrated. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
},
{
"id": 30,
"name": "Association Of Rural Activities And Voluntary Action For Literary Information Aravali",
"description": "Fostering literacy and education for rural development.",
"address": "ARAVALLI, Village Palagadh PO Kuppa Via- Gohand Teh- Nahan Distt- Sirmour (HP)",
"contact": "94595-57942",
"location": "Sirmaur, Himachal Pradesh",
"tags": ["Education", "Literacy"],
"website": "https://aravalliindia.org/",
"payment": "bank name- Bank of India account no.- 841310110010284 - IFSC - BKID0008413",
"About": "Promoting artistic expression and cultural enrichment through theater is the primary focus of Awareness Of this society. We believe in the power of theater to inspire, challenge, and provoke thought. Through our performances, workshops, and community outreach programs, we seek to engage audiences, spark dialogue, and promote social change. Our goal is to create a vibrant cultural landscape where creativity thrives and diverse voices are celebrated. Advancing agricultural practices for sustainable rural development is the driving force behind Action Research And Training's mission. Our organization is committed to empowering rural communities by promoting innovative and sustainable agricultural techniques. Through our research, training, and outreach programs, we seek to improve agricultural productivity, enhance food security, and promote environmental sustainability. Our goal is to create thriving rural communities where farmers have the knowledge and resources they need to succeed."
},
{
  "id": 31,
  "name": "Awareness Of Global Environmental Friendship Society",
  "description": "Promoting sustainable animal husbandry practices for rural livelihoods.",
  "address": "Village Manal, Post Office- Kot Khamradha, Sub tehsil -Aut, District Mandi, Himachal Pradesh, PIN 175121",
  "contact": "+91 9457823456",
  "location": "Mandi, Himachal Pradesh",
  "tags": ["Animal Husbandry"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
  "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
  "About": "Promoting artistic expression and cultural enrichment through theater is the primary focus of Awareness Of Global Environmental Friendship Society. We believe in the power of theater to inspire, challenge, and provoke thought. Through our performances, workshops, and community outreach programs, we seek to engage audiences, spark dialogue, and promote social change. Our goal is to create a vibrant cultural landscape where creativity thrives and diverse voices are celebrated. Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 32,
  "name": "Baba Nand Shah Sewa Samiti",
  "description": "Advocating for human rights and social justice for all.",
  "address": "BABA NAND SHAH SEWA SAMITI, CHOPRA NIWAS, OLD BUS STAND GHUMARWIN, DISTT. BILASPUR (H.P.) PIN-174021",
  "contact": "+91 9812345678",
  "location": "Ghumarwin, Bilaspur, Himachal Pradesh",
  "tags": ["Human Rights"],
  "website": "https://www.searchdonation.com/ngo/baba-nand-shah-sewa-samiti.php",
  "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
  "About": "Baba Nand Shah Sewa Samiti is Empowering communities through education and literacy programs is a transformative endeavor that uplifts individuals and societies alike. By providing access to quality education and fostering literacy skills, these programs pave the way for personal growth, economic advancement, and social cohesion. Education serves as a powerful tool for breaking the cycle of poverty, enabling individuals to secure better employment opportunities and improve their overall quality of life. Moreover, literacy empowers individuals to actively participate in civic life, exercise their rights, and contribute meaningfully to their communities. Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 33,
  "name": "Batt Educational Society",
  "description": "Empowering communities through education and literacy initiatives.",
  "address": "Batt Educational Society V.P.O. Khushnagri, Teh Churah Distt Chamba pin 176316",
  "contact": "+91 9413456789",
  "location": "Churah, Chamba, Himachal Pradesh",
  "tags": ["Education", "Literacy"],
  "website": "https://www.searchdonation.com/ngo/batt-educational-society.php",
  "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706",
  "About": "Batt Educational Society is Providing care and support to underprivileged children for a better future is the cornerstone mission. We are dedicated to ensuring that every child, regardless of their background or circumstances, has access to the resources and opportunities they need to thrive. Through our comprehensive programs, we address the diverse needs of children, including education, healthcare, nutrition, and emotional well-being. Our goal is to empower children to reach their full potential and become active, contributing members of society. Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 34,
  "name": "Bcs College Of Education And Information Technology",
  "description": "Providing educational opportunities for literacy and empowerment.",
  "address": "HEAD OFFICE VILL BHAVRAN PO KITPAL TEHSIL NADAUN DISTRICT HAMIRPUR HP 177038, BRANCH OFFICE NEAR BUS STAND 1ST FLOOR HOSPITAL ROAD NADAUN DISTT. HAMI",
  "contact": "+91 9812345678",
  "location": "Hamirpur, Himachal Pradesh",
  "tags": ["Education", "Literacy"],
  "website": "https://www.searchdonation.com/ngo/batt-educational-society.php",
  "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706",
  "About": "Caring for the elderly population with respect and dignity is at the heart of Bcs College Of Education And Information Technology. We are dedicated to providing comprehensive care and support services to seniors, ensuring their physical, emotional, and social well-being. Our organization believes that every individual deserves to age with dignity and that by providing compassionate care and support, we can enhance the quality of life for our elderly community members. Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 35,
  "name": "Bcs Computer Education Society",
  "description": "Supporting the elderly population with educational and social initiatives.",
  "address": "BCS COMPUTER EDUCATION SOCIETY POORAIN MUHALA, NEAR GOVT. DEGREE COLLEGE SUJANPUR TIHRA PO AND TEHSIL SUJANPUR TIHRA DISTT HAMIRPUR HP PIN 176110",
  "contact": "+91 9812345678",
  "location": "Sujanpur Tihra, Hamirpur, Himachal Pradesh",
  "tags": ["Aged", "Elderly"],
  "website": "https://www.searchdonation.com/bcs-computer-education-society",
  "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706",
  "About": "Caring for the elderly population with respect and dignity is at the heart of Bcs Computer Education Society. We are dedicated to providing comprehensive care and support services to seniors, ensuring their physical, emotional, and social well-being. Our organization believes that every individual deserves to age with dignity and that by providing compassionate care and support, we can enhance the quality of life for our elderly community members. Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 36,
  "name": "Bhagal Shiksha Samiti",
  "description": "Promoting education and literacy for socio-economic development.",
  "address": "Dhalalaghat Dist. Arki Solan",
  "contact": "+91 9456781234",
  "location": "Arki, Solan, Himachal Pradesh",
  "tags": ["Education", "Literacy"],
  "website": "https://www.searchdonation.com/ngo/bhagal-shiksha-samiti.php",
  "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
  "About": "Caring for the elderly population with respect and dignity is at the heart of Bhagal Shiksha Samiti. We are dedicated to providing comprehensive care and support services to seniors, ensuring their physical, emotional, and social well-being. Our organization believes that every individual deserves to age with dignity and that by providing compassionate care and support, we can enhance the quality of life for our elderly community members. Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 37,
  "name": "Black Blanket Welfare Educational Society",
  "description": "Protecting human rights and advocating for justice and equality.",
  "address": "A-2 Titla Hotel Jakhoo Shimla HP 171009",
  "contact": "+91 9456781234",
  "location": "Shimla, Himachal Pradesh",
  "tags": ["Human Rights"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
  "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
  "About": "Empowering individuals through education and literacy initiatives is the core mission of Black Blanket Welfare Educational Society. We believe that education is the key to unlocking human potential and creating a more equitable society. Through our programs, we strive to provide access to quality education and foster literacy skills, enabling personal growth and socio-economic development. Our goal is to empower individuals to realize their dreams and build a brighter future for themselves and their communities.Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 38,
  "name": "Blossom Welfare Society",
  "description": "Providing care and support to underprivileged children for a better future.",
  "address": "House No- 3, Village Banni, Tehsil - Paonta Sahib, Distt- Sirmaur, HP 173025",
  "contact": "+91 9812345678",
  "location": "Paonta Sahib, Sirmaur, Himachal Pradesh",
  "tags": ["Children"],
  "website": "https://www.blossomtrust.org/",
  "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
  "About": "Empowering individuals through education and literacy initiatives is the core mission of Blossom Welfare Society. We believe that education is the key to unlocking human potential and creating a more equitable society. Through our programs, we strive to provide access to quality education and foster literacy skills, enabling personal growth and socio-economic development. Our goal is to empower individuals to realize their dreams and build a brighter future for themselves and their communities.Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 39,
  "name": "Bpssa Foundation",
  "description": "Providing educational opportunities for literacy and empowerment.",
  "address": "Bharti Parisar Sarswati Vihar Khaniyara Road, Near Radha Swami Satsang Ghar, Dharamshala Distt- Kangra (HP) 176215",
  "contact": "+91 9456781234",
  "location": "Dharamshala, Kangra, Himachal Pradesh",
  "tags": ["Education", "Literacy"],
  "website": "https://ngodarpan.gov.in/index.php",
  "payment": "bank name- State bank of India  account no.- 32344893165 - IFSC - SBIN0001706",
  "About": "Empowering individuals through education and literacy initiatives is the core mission of Bpssa Foundation. We believe that education is the key to unlocking human potential and creating a more equitable society. Through our programs, we strive to provide access to quality education and foster literacy skills, enabling personal growth and socio-economic development. Our goal is to empower individuals to realize their dreams and build a brighter future for themselves and their communities.Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 40,
  "name": "Bpssa Group Of Educational Society",
  "description": "Empowering individuals through education and vocational training.",
  "address": "C/O Sangam Associates, Ward No. 2, BPO & Tehsil Nurpur, Distt. Kangra, Himachal Pradesh",
  "contact": "+91 9812345678",
  "location": "Nurpur, Kangra, Himachal Pradesh",
  "tags": ["Education", "Vocational Training"],
  "website": "https://give.do/discover/19YY/saraswati-educational-society/",
  "payment": "bank name- Bank of India   account no.- 841310110010284 - IFSC - BKID0008413",
  "About": "Bpssa Group Of Educational Society is Empowering communities through education and literacy programs is a transformative endeavor that uplifts individuals and societies alike. By providing access to quality education and fostering literacy skills, these programs pave the way for personal growth, economic advancement, and social cohesion. Education serves as a powerful tool for breaking the cycle of poverty, enabling individuals to secure better employment opportunities and improve their overall quality of life. Moreover, literacy empowers individuals to actively participate in civic life, exercise their rights, and contribute meaningfully to their communities.Beyond individual benefits, community-based education initiatives strengthen social bonds and foster a sense of belonging and collective responsibility. As community members come together to learn and share knowledge, they build networks of support and collaboration that transcend socioeconomic divides. These programs also promote cultural preservation and intergenerational learning, preserving heritage and passing down valuable traditions to future generations."
},
{
  "id": 41,
  "name": "Manav Seva Sansthan Berthin",
  "description": "Providing healthcare, empowering women and youth, and managing water resources.",
  "address": "Manav Seva Sansthan berthin-174029 distt. Bilaspurhimachal Pradesh",
  "contact": "9999999999",
  "location": "Bilaspur, Himachal Pradesh",
  "tags": ["Health & Family Welfare", "Women's Development & Empowerment", "Water Resources", "Youth Affairs", "Children"],
  "website": "https://give.do/discover/19YY/saraswati-educational-society/",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Manav Seva Sansthan Berthin is dedicated to providing healthcare services, empowering women and youth, and managing water resources. We believe that access to healthcare is a fundamental right, and we work to ensure that individuals in our community receive the medical care they need. Additionally, we focus on empowering women and youth through education, skill development, and support programs, recognizing their potential to drive positive change in society. Moreover, our efforts in managing water resources aim to ensure sustainable access to clean water for all."
},
{
  "id": 42,
  "name": "Chetna Himachal Pradesh",
  "description": "Supporting children, differently-abled individuals, and offering vocational training.",
  "address": "Village Vijaypur P.o Auhar Tehsil Jhandutta District Bilaspur H.p-174024",
  "contact": "9999999999",
  "location": "Bilaspur, Himachal Pradesh",
  "tags": ["Children", "Differently Abled", "Vocational Training"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Chetna Himachal Pradesh is committed to supporting children and differently-abled individuals while offering vocational training opportunities. Our organization believes in the importance of providing a nurturing environment where children can thrive and reach their full potential. We also recognize the unique challenges faced by differently-abled individuals and strive to create inclusive programs that cater to their specific needs. Through vocational training, we empower individuals with valuable skills that enhance their employability and enable them to lead independent lives."
},
{
  "id": 43,
  "name": "Micro Care Educational Society",
  "description": "Focused on education, environment, health, rural development, and women's empowerment.",
  "address": "New Govt. Degree Collegenew Bus Stand Road Ghumarwin Bilaspurhimachal Pradesh",
  "contact": "9999999999",
  "location": "Ghumarwin, Bilaspur, Himachal Pradesh",
  "tags": ["Education & Literacy", "Environment & Forests", "Health & Family Welfare", "HIV/AIDS", "Human Rights", "Information & Communication Technology", "Micro Finance (SHGs)", "Minority Issues", "Micro Small & Medium Enterprises", "New & Renewable Energy", "Rural Development & Poverty Alleviation", "Scientific & Industrial Research", "Tribal Affairs", "Tourism", "Urban Development & Poverty Alleviation", "Vocational Training", "Women's Development & Empowerment", "Youth Affairs"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Micro Care Educational Society is dedicated to promoting education, environmental conservation, health, rural development, and women's empowerment. We believe in the transformative power of education to break the cycle of poverty and empower individuals to build better futures for themselves and their communities. Our environmental initiatives focus on raising awareness and implementing sustainable practices to protect our planet for future generations. Additionally, we work to improve healthcare access, promote rural development, and empower women to participate fully in social, economic, and political spheres."
},
{
  "id": 44,
  "name": "Aparajita Organization",
  "description": "Involved in agriculture, art & culture, education, and health sectors with a focus on child welfare, rural development, and water resources management.",
  "address": "Near Civil Hospital Ghumarwin teh. Ghumarwin distt. Bilaspur (h.p.)174021",
  "contact": "9999999999",
  "location": "Ghumarwin, Bilaspur, Himachal Pradesh",
  "tags": ["Agriculture", "Animal Husbandry Dairying & Fisheries", "Art & Culture", "Children", "Civic Issues", "Education & Literacy", "Environment & Forests", "Food Processing", "Health & Family Welfare", "HIV/AIDS", "Human Rights", "Labour & Employment", "Rural Development & Poverty Alleviation", "Science & Technology", "Scientific & Industrial Research", "Sports", "Tourism", "Urban Development & Poverty Alleviation", "Vocational Training", "Water Resources", "Women's Development & Empowerment"],
  "website": "https://asrapatna.in/",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Aparajita Organization is actively involved in agriculture, art & culture, education, and health sectors, with a particular focus on child welfare, rural development, and water resources management. Our organization recognizes the importance of addressing the multifaceted needs of communities to promote holistic development. Through various initiatives, we aim to enhance agricultural productivity, preserve cultural heritage, improve educational opportunities, and ensure access to quality healthcare. Additionally, our efforts in rural development and water resources management seek to create sustainable livelihoods and environmental conservation."
},
{
  "id": 45,
  "name": "Hadimba Mahila Kalyan Samiti Bilaspur",
  "description": "Empowering women through various initiatives.",
  "address": "Ist Floor Employment Exchange Ghumarwin District Bilaspur 174021",
  "contact": "9999999999",
  "location": "Ghumarwin, Bilaspur, Himachal Pradesh",
  "tags": ["Education & Literacy"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Hadimba Mahila Kalyan Samiti Bilaspur is dedicated to empowering women through various initiatives. We believe in the importance of gender equality and work to create opportunities for women to thrive and achieve their full potential. Through our programs, we aim to provide women with access to education, skill development, healthcare, and support networks, enabling them to become agents of change in their communities."
},
{
  "id": 46,
  "name": "Naina Mata Gram Vikas Samiti",
  "description": "Promoting rural development and employment opportunities.",
  "address": "Village Palah, P.o. Jamli, Tehsil Sadar, Distt. Bilaspur Hp",
  "contact": "",
  "location": "Bilaspur, Himachal Pradesh",
  "tags": ["Labour & Employment", "Panchayati Raj"],
  "website": "https://www.searchdonation.com/ngo/arushi-gramin-santhan.php",
  "payment": "",
  "About": "Naina Mata Gram Vikas Samiti is committed to promoting rural development and employment opportunities. We believe in the potential of rural communities to drive economic growth and prosperity. Through our initiatives, we aim to empower local residents with the skills, resources, and support they need to improve their livelihoods and create sustainable development pathways. Additionally, we advocate for effective governance structures that prioritize the needs and interests of rural populations."
},

{
  "id": 47,
  "name": "Garam Sudhar Simiti Balh-kareta",
  "description": "Working towards social welfare and community development.",
  "address": "V.p.o. Jamli, Tehsil Sadar, Distt. Bilaspur Hp-174011",
  "contact": "9999999999",
  "location": "Bilaspur, Himachal Pradesh",
  "tags": ["Labour & Employment"],
  "website": "https://www.searchdonation.com/ngo/arushi-gramin-santhan.php",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Garam Sudhar Simiti Balh-kareta is dedicated to working towards social welfare and community development. Our organization aims to address various social issues and uplift the community through initiatives that promote equality, justice, and empowerment. We believe in fostering a sense of solidarity and cooperation among community members to create positive change and improve the overall well-being of society."
},
{
  "id": 48,
  "name": "Bitiya Foundation",
  "description": "Empowering women for a brighter future.",
  "address": "Vpo Barmana Tehsil Sadar Distt. Bilaspur Hp",
  "contact": "999999999",
  "location": "Bilaspur, Himachal Pradesh",
  "tags": ["Women's Development & Empowerment"],
  "website": "https://give.do/discover/19YY/saraswati-educational-society/",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Bitiya Foundation is committed to empowering women for a brighter future. We believe that investing in women's education, health, and economic empowerment is essential for creating positive social change and achieving gender equality. Through our programs and initiatives, we strive to provide women with the tools, resources, and support they need to thrive and succeed in all aspects of life."
},
{
  "id": 49,
  "name": "Ujala Viklaang Avam Anathalaya Trust",
  "description": "Supporting differently-abled individuals and promoting health and welfare.",
  "address": "1st Floor Employement Exchange Dakhri Chowk Ghumarwin H.p 174021",
  "contact": "9999999999",
  "location": "Ghumarwin, Bilaspur, Himachal Pradesh",
  "tags": [ "Health & Family Welfare"],
  "website": "https://www.searchdonation.com/ngo/anjuman-islamia-churah.php",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Ujala Viklaang Avam Anathalaya Trust is dedicated to supporting differently-abled individuals and promoting health and welfare in the community. We believe in creating an inclusive society where individuals with disabilities have equal opportunities to lead fulfilling lives. Through our initiatives, we provide support services, advocate for disability rights, and promote awareness about health and wellness."
},
{
  "id": 50,
  "name": "Manav Vikas Sansthan",
  "description": "Fostering holistic development in rural areas through various interventions.",
  "address": "Vpo. Kalol Tehsil Jhandutta District Bilaspur (h.p)",
  "contact": "9999999999",
  "location": "Bilaspur, Himachal Pradesh",
  "tags": ["Agriculture", "Animal Husbandry Dairying & Fisheries", "Art & Culture", "Drinking Water", "Education & Literacy", "Environment & Forests", "Food Processing", "Health & Family Welfare", "Labour & Employment", "Land Resources", "Micro Finance (SHGs)", "Micro Small & Medium Enterprises", "Nutrition", "Panchayati Raj", "Rural Development & Poverty Alleviation", "Science & Technology", "Tribal Affairs", "Women's Development & Empowerment", "Biotechnology", "Water Resources"],
  "website": " https://www.searchdonation.com/ngo/association-for-rural-technologies.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Manav Vikas Sansthan is dedicated to fostering holistic development in rural areas through various interventions. We believe in addressing the diverse needs of rural communities and empowering them to create sustainable livelihoods. Our organization focuses on initiatives that promote agriculture, education, health, environment, and women's empowerment, aiming to improve the overall quality of life for rural residents."
},
{
  "id": 51,
  "name": "Mahila Mandal Samlohal",
  "description": "Empowering rural women through various programs.",
  "address": "Village Samlohal Po Kapahra Tehsil Ghumarwin Distt Bilaspur Hp",
  "contact": "9999999999",
  "location": "Ghumarwin, Bilaspur, Himachal Pradesh",
  "tags": ["Rural Development & Poverty Alleviation"],
  "website": "https://give.do/discover/19YY/saraswati-educational-society/",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Mahila Mandal Samlohal is committed to empowering rural women through various programs. We believe that empowering women is crucial for sustainable development and poverty alleviation in rural areas. Through our initiatives, we provide women with access to education, skill development, healthcare, and entrepreneurship opportunities, enabling them to become change-makers and leaders in their communities."
},
{
  "id": 52,
  "name": "Kailash Educational Trust",
  "description": "Providing education and vocational training in Hamirpur.",
  "address": "Mit Campus, Ganoh, Po Bani, Teh Barsar Distt Hamirpur H.p.",
  "contact": "9999999999",
  "location": "Hamirpur, Himachal Pradesh",
  "tags": ["Education & Literacy", "Vocational Training"],
  "website": " https://www.searchdonation.com/ngo/association-for-rural-technologies.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Kailash Educational Trust is dedicated to providing education and vocational training in Hamirpur. We believe that education is the key to unlocking individual potential and driving socio-economic development. Through our educational programs, we aim to equip students with the knowledge, skills, and values they need to succeed in life and contribute positively to society. Additionally, our vocational training initiatives empower individuals with practical skills that enhance their employability and economic opportunities."
},
{
  "id": 53,
  "name": "Shridevmemorialeducationtrust",
  "description": "Supporting education and literacy initiatives near Civil Hospital in Hamirpur.",
  "address": "C/o Dev Raj Suresh Kumar, Ward No. 05, Near Civil Hospital, Main Market P.o./tehsil/distt. Hamirpur Pin.code. 177001 (hp)",
  "contact": "9999999999",
  "location": "Hamirpur, Himachal Pradesh",
  "tags": ["Education & Literacy"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Shridevmemorialeducationtrust is dedicated to supporting education and literacy initiatives near Civil Hospital in Hamirpur. We believe that education is the foundation for individual growth and societal progress. Through our programs, we aim to promote literacy, improve access to quality education, and empower individuals to reach their full potential. We are committed to creating a learning environment where every individual has the opportunity to thrive and succeed."
},
       
{
  "id": 54,
  "name": "Himalayan Mahila Avm Jan Kalyan Sanstha",
  "description": "Addressing women's and community development in Bassi, Bhoranj, Hamirpur.",
  "address": "Bassi Tehsil Bhoranj Distt Hamirpur Hp",
  "contact": "9999999999",
  "location": "Bhoranj, Hamirpur, Himachal Pradesh",
  "tags": ["Women's Development & Empowerment", "Community Development"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Himalayan Mahila Avm Jan Kalyan Sanstha is dedicated to addressing women's and community development in Bassi, Bhoranj, and Hamirpur. Our organization works towards empowering women and strengthening communities through various initiatives. We believe in creating a supportive environment where women have equal opportunities to thrive and contribute to the socio-economic development of their communities."
},
{
  "id": 55,
  "name": "The Gautam Girls College Management Committee",
  "description": "Managing Gautam Girls College and focusing on education and literacy.",
  "address": "Gautam Girls College, Ward No.10, Hamirpur",
  "contact": "99999999999",
  "location": "Hamirpur, Himachal Pradesh",
  "tags": ["Education & Literacy"],
  "website": " https://www.searchdonation.com/ngo/association-for-rural-technologies.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "The Gautam Girls College Management Committee is responsible for managing Gautam Girls College in Hamirpur. Our focus is on providing quality education and promoting literacy among students. We believe in empowering young women through education and equipping them with the skills and knowledge they need to succeed in life."
},
{
  "id": 56,
  "name": "Pehchan Education Society",
  "description": "Supporting children and women's development initiatives in Hamirpur.",
  "address": "Vill. Chunal, P.o Bassi Jhainara, Near Centre School, Hamirpur(h.p)",
  "contact": "9999999999",
  "location": "Hamirpur, Himachal Pradesh",
  "tags": ["Children", "Women's Development & Empowerment"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Pehchan Education Society is committed to supporting children and women's development initiatives in Hamirpur. Our organization works towards providing education, healthcare, and empowerment opportunities to children and women from marginalized communities. We believe in creating a nurturing environment where every child and woman has the chance to fulfill their potential and lead a dignified life."
},
{
  "id": 57,
  "name": "Ambitious Educational Society",
  "description": "Engaged in various sectors including agriculture, education, and health in Nadaun, Hamirpur.",
  "address": "Vill. Duleh, P.o Lahar, Teh. Nadaun Distt. Hamirpur H.p 177044",
  "contact": "9999999999",
  "location": "Nadaun, Hamirpur, Himachal Pradesh",
  "tags": ["Agriculture", "Education & Literacy", "Health & Family Welfare"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Ambitious Educational Society is actively engaged in various sectors including agriculture, education, and health in Nadaun, Hamirpur. Our organization works towards holistic development and well-being, addressing the diverse needs of the community. We believe in empowering individuals through education, promoting sustainable agriculture practices, and improving access to healthcare services."
},
{
  "id": 58,
  "name": "Thakur Jagdev Chand Smriti Shodh Sansthan",
  "description": "Dedicated to preserving and promoting art and culture in Neri.",
  "address": "Vpo Neri, Tehsil",
  "contact": "9999999999",
  "location": "Neri, Himachal Pradesh",
  "tags": ["Art & Culture"],
  "website": " https://www.searchdonation.com/ngo/association-for-rural-technologies.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Thakur Jagdev Chand Smriti Shodh Sansthan is dedicated to preserving and promoting art and culture in Neri. Our organization aims to celebrate the rich cultural heritage of the region and ensure its continuity for future generations. Through various cultural programs and initiatives, we strive to foster appreciation for art and culture, promote local talent, and create platforms for artistic expression and exchange."
},
{
  "id": 59,
  "name": "Shree Sai Educational And Animal Welfare Society",
  "description": "Focused on education, employment, and rural development in Jahu.",
  "address": "Thakur Niwas Govt. School Road, Jahu",
  "contact": "9999999999",
  "location": "Jahu, Himachal Pradesh",
  "tags": ["Education & Literacy", "Labour & Employment", "Rural Development & Poverty Alleviation"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Shree Sai Educational And Animal Welfare Society is focused on education, employment, and rural development in Jahu. Our organization believes in the transformative power of education and aims to provide quality education and skill development opportunities to rural youth. Additionally, we are committed to promoting sustainable livelihoods and improving the overall well-being of rural communities through various development initiatives."
},
{
  "id": 60,
  "name": "Pragti Education And Welfare Trust",
  "description": "Promoting education, welfare, and development in Tang, Nadaun.",
  "address": "Village Tang Post Office Jhallan Tehsil Nadaun Distt Hamirpur",
  "contact": "99999999999",
  "location": "Nadaun, Hamirpur, Himachal Pradesh",
  "tags": ["Education & Literacy", "Welfare & Development"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Pragti Education And Welfare Trust is dedicated to promoting education, welfare, and development in Tang, Nadaun. Our organization works towards creating opportunities for education and skill development, empowering individuals to improve their lives and contribute to the community. We are committed to fostering sustainable development and creating a brighter future for the people of Tang and surrounding areas."
},
{
  "id": 61,
  "name": "Late Shri Joginder Singh Education And Welfare Trust",
  "description": "Engaged in various sectors including education, health, and rural development in Tang, Nadaun.",
  "address": "C/o Mukhtiar Singh Village Tang P.o. Jhallan Teh. Nadaun Distt Hamirpur",
  "contact": "9999999999",
  "location": "Nadaun, Hamirpur, Himachal Pradesh",
  "tags": ["Education & Literacy", "Health & Family Welfare", "Rural Development & Poverty Alleviation"],
  "website": " https://www.searchdonation.com/ngo/association-for-rural-technologies.php ",
  "payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Late Shri Joginder Singh Education And Welfare Trust is engaged in various sectors including education, health, and rural development in Tang, Nadaun. Our organization is committed to providing quality education, healthcare, and livelihood opportunities to the residents of Tang and surrounding areas. Through our holistic approach, we aim to uplift the socio-economic status of the community and improve the overall quality of life."
},
       
{
  "id": 62,
  "name": "Doctor Abdul Kalam Society For Human Awareness",
  "description": "Promoting education, health, and women's empowerment in Salouni.",
  "address": "Vpo Salouni Teh Badsar Distt Hamirpur Hp -174311",
  "contact": "9999999999",
  "location": "Salouni, Hamirpur, Himachal Pradesh",
  "tags": ["Education & Literacy", "Health & Family Welfare", "Women's Development & Empowerment"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Doctor Abdul Kalam Society For Human Awareness is committed to improving the lives of individuals in Salouni and surrounding areas. Our focus is on promoting education, ensuring access to healthcare, and empowering women. By providing educational opportunities, healthcare services, and support for women's empowerment initiatives, we strive to create a more equitable and prosperous community. Through our dedicated efforts, we aim to uplift individuals and contribute to the overall development of society."
},
{
  "id": 63,
  "name": "Him-aanchal Pensioners' Sangh",
  "description": "Advocating for pensioners' welfare in Hamirpur.",
  "address": "C/o Pensioner Bhawan, Adjoining Ex-servicemen Health Clinic(ehgc)",
  "contact": "9999999999",
  "location": "Hamirpur, Himachal Pradesh",
  "tags": ["Pensioners' Welfare"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Him-aanchal Pensioners' Sangh is dedicated to advocating for the welfare of pensioners in Hamirpur and surrounding areas. Our organization works tirelessly to address the needs and concerns of pensioners, ensuring they receive the support and assistance they deserve. Through advocacy efforts and community engagement, we strive to enhance the quality of life for pensioners and create a more supportive and inclusive society."
},
{
  "id": 64,
  "name": "Hira Krishna Nagar",
  "description": "Supporting the elderly population in Krishna Nagar, Hamirpur.",
  "address": "Ward No 1 Krishna Nagar Hamirpur 177001",
  "contact": "99999999999",
  "location": "Hamirpur, Himachal Pradesh",
  "tags": ["Aged/Elderly Support"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Hira Krishna Nagar is committed to supporting the elderly population in Krishna Nagar and surrounding areas of Hamirpur. Our organization provides a range of services and assistance to meet the unique needs of senior citizens, ensuring they lead fulfilling and dignified lives. Through our programs and initiatives, we aim to create a supportive and inclusive community where the elderly are valued and respected."
},
{
  "id": 65,
  "name": "Regional Education And Environmental Society Distt Hamirpur",
  "description": "Promoting environmental awareness and education in Bani, Barsar.",
  "address": "Vpo Bani Tehsil Barsardistthamirpur (himachal Pradesh )",
  "contact": "9999999999",
  "location": "Bani, Barsar, Hamirpur, Himachal Pradesh",
  "tags": ["Environmental Awareness", "Education & Literacy"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Regional Education And Environmental Society Distt Hamirpur is dedicated to promoting environmental awareness and education in Bani, Barsar, and surrounding areas. Our organization believes in the importance of environmental conservation and sustainability, and we work to educate and engage the community on these issues. Through our initiatives, we aim to inspire positive action and foster a culture of environmental stewardship."
},
{
  "id": 66,
  "name": "Hind Social Environmental And Rural Uplift Society",
  "description": "Addressing rural development and health issues in Jhanikkar, Barara, Tauni Devi.",
  "address": "Vill.jhanikkar P.o. Bararateh. Tauni Devi Distt. Hamirpur ( H.p) Pin. 177023",
  "contact": "9999999999",
  "location": "Jhanikkar, Barara, Tauni Devi, Hamirpur, Himachal Pradesh",
  "tags": ["Rural Development & Health"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Hind Social Environmental And Rural Uplift Society is dedicated to addressing rural development and health issues in Jhanikkar, Barara, Tauni Devi, and surrounding areas of Hamirpur. Our organization implements a range of programs and initiatives aimed at improving access to healthcare services, promoting sustainable development, and enhancing the overall well-being of rural communities. Through our collaborative efforts, we strive to create positive change and uplift the lives of individuals in rural areas."
},
{
  "id": 67,
  "name": "Kranti Yuvak Mandal Jhokhar",
  "description": "Engaged in community development in Jhokhar, Tauni Devi.",
  "address": "Village Jhokhar, Po And Tehsil Tauni Devi (bamson), District Hamirpur,himachal Pradesh. Pin-177023",
  "contact": "9999999999",
  "location": "Jhokhar, Tauni Devi, Hamirpur, Himachal Pradesh",
  "tags": ["Community Development"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Kranti Yuvak Mandal Jhokhar is actively engaged in community development initiatives in Jhokhar, Tauni Devi, and surrounding areas of Hamirpur. Our organization works closely with the local community to identify needs and implement projects that promote social welfare and economic development. Through our grassroots efforts, we aim to empower individuals, build resilient communities, and create positive change at the grassroots level."
},
{
  "id": 68,
  "name": "Veer Bhumi Trust Bijhari",
  "description": "Engaged in various community welfare activities in Bijhari.",
  "address": "V.p.o. Bijhari Tehsil.datwal.distt. Hamirpur (h.p) Pin Code -176040",
  "contact": "99999999999",
  "location": "Bijhari, Hamirpur, Himachal Pradesh",
  "tags": ["Community Welfare"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Veer Bhumi Trust Bijhari is committed to serving the community and addressing the needs of residents in Bijhari and surrounding areas of Hamirpur. Our organization engages in various community welfare activities aimed at improving the quality of life for individuals and families. Through our collaborative efforts and community-driven initiatives, we strive to create positive change and foster a sense of belonging and well-being among community members."
},
{
  "id": 69,
  "name": "Him Academy Shiksha Samiti",
  "description": "Managing educational initiatives in Housing Board Colony, Hamirpur.",
  "address": "M-21 B, Housing Board Colony, Hamirpur, Himachal Pradesh, Pin 177001",
  "contact": "99999999999",
  "location": "Housing Board Colony, Hamirpur, Himachal Pradesh",
  "tags": ["Education Management"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Him Academy Shiksha Samiti is dedicated to managing educational initiatives and promoting academic excellence in Housing Board Colony, Hamirpur, and surrounding areas. Our organization is committed to providing quality education and creating a conducive learning environment for students. Through innovative programs and dedicated efforts, we aim to empower students, nurture their talents, and prepare them for a successful future."
},
{
  "id": 70,
  "name": "Maha Rani Laxmi Bai Education Sociecty",
  "description": "Promoting education in Bhareri, Bhoranj.",
  "address": "Vpo Bhareri Teshil Bhoranj disrict Hamirpur Himachal Pradesh",
  "contact": "99999999999",
  "location": "Bhareri, Bhoranj, Hamirpur, Himachal Pradesh",
  "tags": ["Education Promotion"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Maha Rani Laxmi Bai Education Sociecty is dedicated to promoting education and literacy in Bhareri, Bhoranj, and surrounding areas of Hamirpur. Our organization believes in the power of education to transform lives and communities. Through our educational initiatives and advocacy efforts, we strive to increase access to quality education, empower individuals, and create a more equitable and prosperous society."
},
{
  "id": 71,
  "name": "Gunjan",
  "description": "Engaged in various community development activities in Dharmsala.",
  "address": "Gunjan Organisation For Community Development, near Eagle Motor Service Station, Sham Nagar, Dharmsala District Kangra, Himachal Pradesh, Pin176215",
  "contact": "Phone: 911892224255, Email: Gunjandma@yahoo.co.uk",
  "location": "Dharmsala, Kangra, Himachal Pradesh",
  "tags": ["Community Development"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Gunjan is actively engaged in various community development activities in Dharmsala and surrounding areas of Kangra, Himachal Pradesh. Our organization works to address pressing social issues, empower marginalized communities, and promote sustainable development. Through collaborative partnerships and grassroots initiatives, we aim to create positive change and build a more inclusive and resilient society for all."
},
       
{
  "id": 72,
  "name": "Association For Rural And Technical Education Centre",
  "description": "Engaged in rural and technical education initiatives in Mahendru, Dehra.",
  "address": "Artec, Regd. Office-: Village Mahendru, P.o. Katora, Tehsil Dehra, District Kangra, Himachal Pradesh 176027",
  "contact": "99999999999",
  "location": "Mahendru, Dehra, Kangra, Himachal Pradesh",
  "tags": ["Rural Education", "Technical Education"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Association For Rural And Technical Education Centre is dedicated to advancing rural and technical education initiatives in Mahendru, Dehra, and surrounding areas of Kangra, Himachal Pradesh. Our organization is committed to providing quality education and technical skills training to empower individuals and enhance their livelihood opportunities. Through our programs and initiatives, we aim to bridge the gap between rural and urban education standards and foster socio-economic development in rural communities."
},
{
  "id": 73,
  "name": "Sambhota Tibetan School",
  "description": "Managing educational institutions and promoting nutrition in Dharamsala.",
  "address": "Sambhota Tibetan Schools Society, Session Road- Dharamsala-176215 H.p ( State)",
  "contact": "9999999999",
  "location": "Dharamsala, Kangra, Himachal Pradesh",
  "tags": ["Education Management", "Nutrition Promotion"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Sambhota Tibetan School is dedicated to managing educational institutions and promoting nutrition in Dharamsala and surrounding areas of Kangra, Himachal Pradesh. Our organization is committed to providing quality education and ensuring access to nutritious meals for students. Through our holistic approach to education, we aim to nurture the intellectual, physical, and emotional well-being of students and empower them to achieve their full potential."
},
{
  "id": 74,
  "name": "Saksharta Foundation Trust",
  "description": "Promoting literacy and education in Rey, Fatehpur.",
  "address": "V.p.o Rey Tehsil Fatehpur Distt. Kangra (h.p) 176058",
  "contact": "9999999999",
  "location": "Rey, Fatehpur, Kangra, Himachal Pradesh",
  "tags": ["Literacy Promotion", "Education Support"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Saksharta Foundation Trust is committed to promoting literacy and education in Rey, Fatehpur, and surrounding areas of Kangra, Himachal Pradesh. Our organization believes in the transformative power of education and works to increase access to educational resources and opportunities for individuals of all ages. Through our literacy promotion programs and educational support initiatives, we aim to empower individuals, strengthen communities, and foster socio-economic development."
},
{
  "id": 75,
  "name": "HH The Dalai Lamas Central Tibetan Relief Committee",
  "description": "Supporting agriculture, elderly care, and vocational training in Dharamsala.",
  "address": "Central Tibetan Relief Committee, Central Tibetan Administration gangchen Kyishong dharamsala, District Kangra himachal Pradesh 176215",
  "contact": "9999999999",
  "location": "Dharamsala, Kangra, Himachal Pradesh",
  "tags": ["Agriculture Support", "Elderly Care", "Vocational Training"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "HH The Dalai Lamas Central Tibetan Relief Committee is dedicated to supporting agriculture, elderly care, and vocational training initiatives in Dharamsala and surrounding areas of Kangra, Himachal Pradesh. Our organization works to improve the livelihoods of local communities by promoting sustainable agriculture practices, providing care and support for the elderly, and offering vocational training programs to enhance employability. Through our holistic approach, we aim to create positive change and contribute to the well-being of individuals and communities."
},
{
  "id": 76,
  "name": "Khadi Gramodyog Sansthan Nagrota",
  "description": "Promoting khadi and cottage industries in Nagrota Bagwan.",
  "address": "P.o.-nagrota Bagwan,teh.-nagrota Bagwan 176047",
  "contact": "99999999999",
  "location": "Nagrota Bagwan, Himachal Pradesh",
  "tags": ["Khadi Promotion", "Cottage Industries"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Khadi Gramodyog Sansthan Nagrota is committed to promoting khadi and cottage industries in Nagrota Bagwan and surrounding areas of Himachal Pradesh. Our organization aims to revive traditional handicrafts and promote sustainable livelihoods through the production and marketing of khadi products and cottage industry goods. Through our efforts, we seek to empower local artisans, create employment opportunities, and preserve cultural heritage."
},
{
  "id": 77,
  "name": "Indian Red Cross Society Kangra At Dharamshala",
  "description": "Supporting the differently-abled and promoting health in Dharamshala.",
  "address": "Indian Red Cross Society Near Head Post Office Dharamshala Distt. Kangra H.p.176215",
  "contact": "9999999999",
  "location": "Dharamshala, Kangra, Himachal Pradesh",
  "tags": ["Differently Abled Support", "Health Promotion"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Indian Red Cross Society Kangra At Dharamshala is dedicated to supporting the differently-abled and promoting health in Dharamshala and surrounding areas of Kangra, Himachal Pradesh. Our organization provides a range of services and assistance to individuals with disabilities, including medical aid, rehabilitation, and social support. Additionally, we work to promote health and well-being through various public health initiatives and awareness campaigns."
},
{
  "id": 78,
  "name": "Library Of Tibetan Works And Archives",
  "description": "Preserving Tibetan culture and promoting cultural studies in Dharamshala.",
  "address": "Library Of Tibetan Works And Archivescentre For Tibetan Studies gangchen Kyishong 176215",
  "contact": "99999999999",
  "location": "Dharamshala, Kangra, Himachal Pradesh",
  "tags": ["Cultural Preservation", "Cultural Studies"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Library Of Tibetan Works And Archives is dedicated to preserving Tibetan culture and promoting cultural studies in Dharamshala and surrounding areas of Kangra, Himachal Pradesh. Our organization collects, preserves, and disseminates Tibetan literature, art, and historical documents to ensure the continuity and vitality of Tibetan culture. Additionally, we offer educational programs and resources to promote the study and appreciation of Tibetan culture and heritage."
},
{
  "id": 79,
  "name": "Khampagar Monastic Charitable Trust",
  "description": "Supporting various community welfare initiatives in Tashi Jong, Baijnath.",
  "address": "Khampagar Monastery, Vill. Tashi Jong, P.o Taragarh, Tehsil Baijnath, Distt. Kangra Himachal Pradesh, India pin: 176081",
  "contact": "99999999999",
  "location": "Tashi Jong, Baijnath, Kangra, Himachal Pradesh",
  "tags": ["Community Welfare"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Khampagar Monastic Charitable Trust is dedicated to supporting various community welfare initiatives in Tashi Jong, Baijnath, and surrounding areas of Kangra, Himachal Pradesh. Our organization works to address the needs of local communities by providing essential services and assistance in areas such as healthcare, education, and social welfare. Through our collaborative efforts and community-driven initiatives, we strive to create positive change and foster a sense of belonging and well-being among community members."
},
{
  "id": 80,
  "name": "Global Hands For Rural Development",
  "description": "Supporting children and women's development initiatives in Samula and Garh Jamula.",
  "address": "Titeli Home For Children Village Samula Post Phared Tehsil Palampur Distt Kangra Hp 176064 regd Add. Global Hands For Rural Development Vpo Garh Jamula Teh Palampur Distt Kangra Hp 176092",
  "contact": "999999999",
  "location": "Samula and Garh Jamula, Palampur, Kangra, Himachal Pradesh",
  "tags": ["Children's Development", "Women's Development & Empowerment"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Global Hands For Rural Development is dedicated to supporting children and women's development initiatives in Samula and Garh Jamula, Palampur, and surrounding areas of Kangra, Himachal Pradesh. Our organization works to empower marginalized communities and improve the well-being of children and women through education, healthcare, and skill development programs. Through our collaborative partnerships and community-driven approach, we aim to create sustainable solutions to address the challenges facing rural communities and promote inclusive development."
},
{
  "id": 81,
  "name": "Tong Len Charitable Trust",
  "description": "Supporting children and community development in Mohal Jather, Mojja Sarah, Dharamshala.",
  "address": "Tong-len Charitable Trust v.p.o. Mohal Jather Mojja Sarah, Tehsil Dharamshala Distt. Kangra (h.p) Pin 176215",
  "contact": "9999999999",
  "location": "Mohal Jather, Mojja Sarah, Dharamshala, Kangra, Himachal Pradesh",
  "tags": ["Children's Support", "Community Development"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Tong Len Charitable Trust is dedicated to supporting children and community development initiatives in Mohal Jather, Mojja Sarah, Dharamshala, and surrounding areas of Kangra, Himachal Pradesh. Our organization works to provide underprivileged children with access to education, healthcare, and other essential services. Additionally, we engage in community development projects to empower local residents and improve overall living standards. Through our holistic approach, we aim to create a positive impact and foster sustainable development in the region."
},
{
  "id": 82,
  "name": "Family And Welfare Project Society",
  "description": "Engaged in various community welfare activities in Rait, Shahpur.",
  "address": "C/o Ranjeet Singh, Vpo Rait, Tehsil Shahpur, District Kangra H.p. 176058",
  "contact": "9999999999",
  "location": "Rait, Shahpur, Kangra, Himachal Pradesh",
  "tags": ["Community Welfare"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Family And Welfare Project Society is committed to improving the well-being of communities in Rait, Shahpur, and surrounding areas of Kangra, Himachal Pradesh. Our organization engages in various community welfare activities aimed at addressing the needs of vulnerable groups and promoting socio-economic development. Through initiatives focused on healthcare, education, and social empowerment, we strive to create positive change and enhance the quality of life for individuals and families in our community."
},
{
  "id": 83,
  "name": "Jamyang Choling Institute",
  "description": "Engaged in cultural preservation and promotion in Mcleodganj.",
  "address": "Near Chinor Lodge, Mcleodganj",
  "contact": "99999999999",
  "location": "Mcleodganj, Himachal Pradesh",
  "tags": ["Cultural Preservation", "Cultural Promotion"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Jamyang Choling Institute is dedicated to the preservation and promotion of Tibetan culture in Mcleodganj and surrounding areas of Himachal Pradesh. Our organization works to safeguard Tibetan heritage through cultural preservation efforts and promote understanding and appreciation of Tibetan traditions. Through educational programs, cultural events, and community outreach initiatives, we strive to ensure the continuity and vitality of Tibetan cultural heritage."
},
{
  "id": 84,
  "name": "Arya Educational And Employment Society",
  "description": "Promoting education, employment, and community welfare in Mumta, Nagrota Bagwan.",
  "address": "Vpo Mumta, Nagrota Bagwan, Kangra, H.p",
  "contact": "9999999999",
  "location": "Mumta, Nagrota Bagwan, Kangra, Himachal Pradesh",
  "tags": ["Education Promotion", "Employment Support", "Community Welfare"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Arya Educational And Employment Society is committed to promoting education, employment, and community welfare in Mumta, Nagrota Bagwan, and surrounding areas of Kangra, Himachal Pradesh. Our organization strives to empower individuals through access to quality education and skill development opportunities. We also work to enhance employment prospects and promote socio-economic development through community-based initiatives. Through our holistic approach, we aim to create a positive impact and foster inclusive growth."
},
{
  "id": 85,
  "name": "Society For Environment And Rural Awakening Era",
  "description": "Engaged in various sectors including agriculture, education, and environment in Shyam Nagar, Thamba, Khundian.",
  "address": "Era Parisar, Shyam Nagar, Thamba, Khundian, Kangra-176030, H.p",
  "contact": "9999999999",
  "location": "Shyam Nagar, Thamba, Khundian, Kangra, Himachal Pradesh",
  "tags": ["Agriculture", "Education & Literacy", "Environment & Forests"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Society For Environment And Rural Awakening Era is dedicated to promoting sustainable development in Shyam Nagar, Thamba, Khundian, and surrounding areas of Kangra, Himachal Pradesh. Our organization works across various sectors, including agriculture, education, and environment, to address the needs of rural communities and promote holistic development. Through our initiatives, we aim to empower local residents, protect natural resources, and build resilient communities for the future."
},
{
  "id": 86,
  "name": "Surya Uday Charitable Trust",
  "description": "Supporting the differently-abled and elderly in Yol Cantt, Dharamshala.",
  "address": "Ward No. 04, Banroru Road, Tikka Lehsar, Yol Cantt, Tehsil Dharamshala",
  "contact": "99999999999",
  "location": "Yol Cantt, Dharamshala, Kangra, Himachal Pradesh",
  "tags": ["Differently Abled Support", "Elderly Support"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Surya Uday Charitable Trust is dedicated to supporting the differently-abled and elderly residents of Yol Cantt, Dharamshala, and surrounding areas of Kangra, Himachal Pradesh. Our organization provides a range of services and assistance aimed at enhancing the quality of life and promoting the well-being of individuals with disabilities and senior citizens. Through our compassionate care and support, we strive to create an inclusive and supportive community for all."
},
{
  "id": 87,
  "name": "Thakur Karam Singh Charitable Trust",
  "description": "Supporting women's development and microfinance initiatives in Lagbaliana, Dehra.",
  "address": "Head Office:lagbaliana Tehsil Dehra Distt Kangrahp",
  "contact": "99999999999",
  "location": "Lagbaliana, Dehra, Kangra, Himachal Pradesh",
  "tags": ["Women's Development & Empowerment", "Microfinance"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Thakur Karam Singh Charitable Trust is dedicated to supporting women's development and microfinance initiatives in Lagbaliana, Dehra, and surrounding areas of Kangra, Himachal Pradesh. Our organization works to empower women through access to education, skill development, and financial resources. We also provide microfinance services to promote entrepreneurship and economic self-sufficiency among women. Through our initiatives, we aim to create opportunities for women to thrive and contribute to their communities."
},
{
  "id": 88,
  "name": "Excel Society For Information Technology And Education",
  "description": "Engaged in education and information technology initiatives in Nagrota Bagwan.",
  "address": "Near Panchsheel Hospital, Nagrota Bagwan, Tehsil Nagrota Bagwan",
  "contact": "9999999999",
  "location": "Nagrota Bagwan, Himachal Pradesh",
  "tags": ["Education & Literacy", "Information Technology"],
  "website": "https://www.searchdonation.com/ngo/association-for-rural-technologies.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Excel Society For Information Technology And Education is committed to promoting education and information technology initiatives in Nagrota Bagwan and surrounding areas of Kangra, Himachal Pradesh. Our organization works to bridge the digital divide and enhance access to quality education and technology resources for all. Through our educational programs and IT initiatives, we aim to empower individuals, uplift communities, and foster inclusive development."
},
{
  "id": 89,
  "name": "Him Prabha Welfare Society",
  "description": "Engaged in various community welfare activities in Behin, Dehra.",
  "address": "Behin, Tehsil Dehra, Distt. Kangra, Himachal Pradesh",
  "contact": "999999999",
  "location": "Behin, Dehra, Kangra, Himachal Pradesh",
  "tags": ["Community Welfare"],
  "website": "https://www.searchdonation.com/ngo/black-blanket-welfare-educational-society.php",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "Him Prabha Welfare Society is dedicated to serving the needs of communities in Behin, Dehra, and surrounding areas of Kangra, Himachal Pradesh. Our organization is actively involved in various community welfare activities aimed at improving the lives of local residents. From healthcare and education to social empowerment and environmental conservation, we work across multiple sectors to address the diverse needs of our community members and promote sustainable development."
},
{
  "id": 90,
  "name": "New Chamunda Pickle Society For Rural Development & Technology",
  "description": "Promoting rural development and technology in Bundla Tea Estate, Palampur.",
  "address": "Village Bundla Tea Estate Post Office Samloti Tehsil Palampur Distt Kangra Himachal Pradesh Pin-176061",
  "contact": "9999999999",
  "location": "Bundla Tea Estate, Palampur, Kangra, Himachal Pradesh",
  "tags": ["Rural Development", "Technology Promotion"],
  "website": "https://www.searchdonation.com/awareness-of-global-environmental-friendship-society",
"payment": "Bank Name - Bank of India, Account No. - 841310110010284, IFSC - BKID0008413",
  "About": "New Chamunda Pickle Society For Rural Development & Technology is committed to promoting rural development and technology adoption in Bundla Tea Estate, Palampur, and surrounding areas of Kangra, Himachal Pradesh. Our organization works to empower rural communities by introducing innovative technologies and sustainable practices. Through our initiatives focused on agriculture, technology, and community development, we aim to enhance livelihoods, improve infrastructure, and foster economic growth in ruralareas."
}
]



